**step-5**

**add a new column on exhisting dataframe**

In [2]:
#create a data frame with name age and city
import pandas as pd

In [3]:
name=['ak','sobhan','aryan']
age=[20,30,40]
city=['bam','bbsr','ctc']
pd.DataFrame(zip(name,age,city))

        0   1     2
0      ak  20   bam
1  sobhan  30  bbsr
2   aryan  40   ctc

- if u want to add new column

- 1st check how many rows are there

- for ex in above dataframe we have 3 rows

- ur new column also have 3 rows

- suppose i want to create a new column: **education**

- make a lsit with 3 values

- ed=['btech','bca','mca']

**syntax** : dataframe[column]=list of values

In [5]:
name=['ak','sobhan','aryan']
age=[20,30,40]
city=['bam','bbsr','ctc']
pd.DataFrame(zip(name,age,city))

        0   1     2
0      ak  20   bam
1  sobhan  30  bbsr
2   aryan  40   ctc

In [6]:
name=['ak','sobhan','aryan']
age=[20,30,40]
city=['bam','bbsr','ctc']
ed=['btech','bca','mca']
salary=[100,200,300]
df=pd.DataFrame(zip(name,age,city))
df['education']=ed
df['s']=salary
print(df)

        0   1     2 education    s
0      ak  20   bam     btech  100
1  sobhan  30  bbsr       bca  200
2   aryan  40   ctc       mca  300

**use case-1**

- create a empty dataframe

- create 3 list using 3 list comprehension

- list1 frm 1 to 10

- list2 squ of list1

- list3 cube of list1

- finally make a data frame

In [8]:
#import pandas as p
l1=[i for i in range (1,11)]
l2=[i*i for i in l1]
l3=[i**3 for i in l1]
col=['num','sqr','cub']
df1=pd.DataFrame(zip(l1,l2,l3),columns=col)
df1

   num  sqr   cub
0    1    1     1
1    2    4     8
2    3    9    27
3    4   16    64
4    5   25   125
5    6   36   216
6    7   49   343
7    8   64   512
8    9   81   729
9   10  100  1000

In [9]:
print(df1.to_string(index=False,justify='center'))

 num  sqr  cub
  1    1     1
  2    4     8
  3    9    27
  4   16    64
  5   25   125
  6   36   216
  7   49   343
  8   64   512
  9   81   729
 10  100  1000

**step-6**

**update the already exhisted column**

- create a new column

    - df['s']

    - creating a new column the column name is our choice

- update exhisting column area same way 

    - here also we need a make a list of values = nmber of rows

    - while updating the exhisting column

    - we need to provide already exhisted column name only

    - df['s']=list of values

In [12]:
name=['ak','sobhan','aryan']
age=[20,30,40]
city=['bam','bbsr','ctc']
ed=['btech','bca','mca']
salary=[100,200,300]
df=pd.DataFrame(zip(name,age,city))
df['education']=ed
df['s']=salary
print(df)

        0   1     2 education    s
0      ak  20   bam     btech  100
1  sobhan  30  bbsr       bca  200
2   aryan  40   ctc       mca  300

In [13]:
z=[i*2 for i in salary]
df['s']=z
df

        0   1     2 education    s
0      ak  20   bam     btech  200
1  sobhan  30  bbsr       bca  400
2   aryan  40   ctc       mca  600

**step-7**

**drop the column**

In [15]:
df1

   num  sqr   cub
0    1    1     1
1    2    4     8
2    3    9    27
3    4   16    64
4    5   25   125
5    6   36   216
6    7   49   343
7    8   64   512
8    9   81   729
9   10  100  1000

In [16]:
#how to check the  columns
df1.columns

Index(['num', 'sqr', 'cub'], dtype='object')

if you want to drop a specific column
- we will use drop method
- we already know about differencede between keywords and methods
- keywords will use directly
- methods will use with corresponding dataframe
- *method name is: drop*

**df1.drop()**

- column: which column you want to drop 

- axis : represents the specific value is a row or column

    - axis=0 means row
    - axis=1 means column
    - by default axis=0
 
- inplace:will provide overwrite the dataframe or not
    - inplace =True ,this indicates overwrite the dataframe
    - inplace =False ,this indicates the modified dataframe will be use when u provide new variable for the operation

In [36]:
df1.drop('num',axis=1,inplace=True)

KeyError: "['num'] not found in axis"

In [20]:
df1

   sqr   cub
0    1     1
1    4     8
2    9    27
3   16    64
4   25   125
5   36   216
6   49   343
7   64   512
8   81   729
9  100  1000